/***  p01ex09.c  ***/

#include <stdio.h>
int main()
{
	/*変数宣言*/
	double num1,calc1,calc2,π;
	π=3.14159265358979;
	/*キー取得*/
	printf("π=3.14159265358979\nr[cm]=");
	scanf("%lf",&num1);
	calc1=4*π*num1*num1*num1/3;
	calc2=4*π*num1*num1;
	printf("球の体積(V)=%lf[cm3]\n",calc1);
	printf("表面積(S)=%lf[cm2]\n",calc2);
	return 0;
}


/**************** 実行結果 *****************
r[cm]=0.1
球の体積(V)=0.004189[cm3]
表面積(S)=0.125664[cm2]

r[cm]=0.3
球の体積(V)=0.113097[cm3]
表面積(S)=1.130973[cm2]

r[cm]=3.0
球の体積(V)=113.097336[cm3]
表面積(S)=113.097336[cm2]

r[cm]=10.0
球の体積(V)=4188.790205[cm3]
表面積(S)=1256.637061[cm2]
*******************************************/
