/***  p03ex05.c  ***/
#include <stdio.h>

int main()
{
    int sum, count, x;
    double mean;
    sum=0;
    count=0;
    printf("正成数値-->");
    scanf("%d",&x);

    if(0<=x){
        while(x>=0){
            sum=sum+x;
            count++;
            printf("正成数値-->");
            scanf("%d",&x);
        }
        mean=(double)sum/(double)count;
        printf("合計値=%d\n",sum);
        printf("平均値=%.1lf\n",mean);
    }else{
        printf("合計値と平均値は求められない");	
    }
    return 0;
}


/**************** 実行結果 *****************

正成数値-->1
正成数値-->2
正成数値-->3
正成数値-->4
正成数値-->5
正成数値-->6
正成数値-->7
正成数値-->8
正成数値-->9
正成数値-->10
正成数値-->-1
合計値=55
平均値=5.5

正成数値-->1
正成数値-->2
正成数値-->3
正成数値-->4
正成数値-->5
正成数値-->-1
合計値=15
平均値=3.0

正成数値-->-1
合計値と平均値は求められない

*******************************************/

