/***  p03ex10.c  ***/
#include <stdio.h>
#include <math.h>

int main()
{
	double b,c,xx,yy;
	xx=0;
	yy=0;
	printf("b,cを入力してください >>");
	scanf("%lf,%lf",&b,&c);
	printf("b=%lf c=%lf\n",b,c);
	xx=b*b-4.0*c;
	if(xx>0){
		yy=sqrt(xx);
		printf("２つの実数解：%lf, %lf",(-1*b+yy)/2.0,(-1*b-yy)/2.0);
	}else if(xx<0){
		xx=-1*xx;
		printf("２つの虚数解：実部%lf±虚部%lfi",-1*b/2.0,xx/2.0);
	}else{
		printf("２つの重解：%lf",-1*b/2.0);
	}
	return 0;
}


/**************** 実行結果 *****************
b,cを入力してください >>4,3
b=4.000000 c=3.000000
２つの実数解：-1.000000, -3.000000

b,cを入力してください >>4,4
b=4.000000 c=4.000000
２つの重解：-2.000000

b,cを入力してください >>4,5
b=4.000000 c=5.000000
２つの虚数解：実部-2.000000±虚部2.000000i
*******************************************/
